IDEA Open Model
ConcFireDiagramType Enumeration
Compatible with IDEA StatiCa Beta 20.0
 Concrete stress-strain diagram for fire
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public enum ConcFireDiagramType
Public Enumeration ConcFireDiagramType
Members
Member name | Value | Description
ByCodeWithAutomaticTemperature | 0 |  By the code with automatic temperature type
ByCodeWithFixedTemperature | 1 |  By the code with fixed temperature type
See Also
Reference
IdeaRS.OpenModel.Material Namespace